<?php
// Heading
$_['page_title']    = 'Мои способы доставки';
$_['tab_general']    = 'Настройки';
$_['tab_rate']    = 'Настройки способа';
$_['module_status']    = 'Статус модуля';
$_['text_debug']    = 'Отладка:';
$_['text_description']    = 'Показать описание доставки в письме E-mail:';
$_['text_desc_estimate_popup']    = 'Рассчитать доставку и налоги';
$_['text_desc_delivery_method']    = 'Способ доставки Шаг';
$_['text_desc_confirmation']    = 'Шаг подтверждения';
$_['text_desc_site_order_detail']    = 'Детали клиента';
$_['text_desc_admin_order_detail']    = 'Детали заказа для админа';
$_['text_desc_order_email']    = 'Email';
$_['text_desc_order_invoice']    = 'Счет';
$_['text_edit']        = 'Редактировать Мои способы доставки';

// Text 
$_['text_extension']  = 'Расширения';
$_['text_shipping']    = 'Доставка';
$_['text_success']     = 'Успешно: Вы изменили модуль доставки!';

$_['text_select_all']    = 'Выбрать все';
$_['text_unselect_all']    = 'Снять все';
$_['text_any']    = 'Для любых';
$_['text_heading']    = 'Заголовок группы способов';
$_['no_unit_row']    = 'Нет дипазонов!';

//group
$_['text_group_shipping_mode']    = 'Группа из групп';
$_['entry_group']    = 'Выбрать группу';
$_['entry_group_tip']    = 'Выбрать группу';
$_['text_group_none']    = 'Нет';
$_['text_no_grouping']    = 'Не группировать';
$_['text_lowest']    = 'Самый низкий';
$_['text_highest']    = 'Самый высокий';
$_['text_average']    = 'Средний';
$_['text_sum']    = 'Сумма';
$_['text_and']    = 'и';
$_['text_group_type']    = 'Тип группы';
$_['text_group_limit']    = 'Кол-во способов для показа';
$_['text_group_name']    = 'Название группы';
$_['text_method_group']    = 'Группы способов';
$_['tip_method_group']    = 'Вы можете разделить ваши методы доставки до 10 групп и могут применяться различные операции для каждой группы. В случае максимальной / минимальной операции вы можете установить ограничение на количество методов, которые вы хотите показать. Здесь доступен групповой режим <br/> <b> Самый низкий </b>: будет показан только способ доставки с наименьшей стоимостью. <br/> <b> Самый высокий </b>: будет показан только способ доставки с самой высокой стоимостью . <br/> <b> Средняя </b>. Все транспортные расходы будут усреднены. <br/> <b> Сумма </b>. Все транспортные расходы будут суммированы. <br/> <b> И </b>: все способы доставки группы будут рассматриваться как операция «AND». Только первый способ доставки группы будет показан, только если все способы доставки группы подтверждают все правила.';
$_['tab_general_global']    = 'Группы опций';
$_['tab_general_general']    = 'Главные';


$_['text_add_new_method']    = 'Добавить новый способ';
$_['text_remove']    = 'Удалить';
$_['text_general']    = 'Главные';
$_['text_criteria_setting']    = 'Зависимости';
$_['text_category_product']    = 'Категория/Товар';
$_['text_price_setting']    = 'Стоимость';
$_['text_others']    = 'Другие';
$_['text_zip_postal']    = 'Почтовый индекс';
$_['text_enter_zip']    = 'Введите индекс';
$_['text_zip_rule']    = 'Условия по индексу';
$_['text_zip_rule_inclusive']    = 'Только для введенных почтовых индексов';
$_['text_zip_rule_exclusive']    = 'Для всех, кроме введенных почтовых индексов';
$_['text_group_limit']    = 'Количество способов для отображения:';
$_['text_method_remove']    = 'Удалить способ';
$_['text_method_copy']    = 'Скопировать способ';

$_['text_coupon']    = 'Купон';
$_['text_enter_coupon']    = 'Введите коды купонов';
$_['text_coupon_rule']    = 'Условия по купонам';
$_['text_coupon_rule_inclusive']    = 'Только для введенных купонов';
$_['text_coupon_rule_exclusive']    = 'Для всех, кроме введенных кодов купонов';

$_['text_rate_type']    = 'Тип';
$_['text_rate_flat']    = 'Фиксированная сумма';
$_['text_rate_quantity']    = 'От количества';
$_['text_rate_weight']    = 'От веса';
$_['text_rate_volume']    = 'От объема';
$_['text_rate_total']    = 'От суммы заказа';
$_['text_grand_total']    = 'От общей суммы Итого';
$_['text_rate_total_coupon']    = 'От суммы без купона';

$_['text_rate_total_method']    = 'От Итого - Собственные настройки';
$_['text_rate_sub_total_method']    = 'От Суммы - Собственные настройки';
$_['text_rate_quantity_method']    = 'От количества - Собственные настройки';
$_['text_rate_weight_method']    = 'От веса - Собственные настройки';
$_['text_rate_volume_method']    = 'От объема - Собственные настройки';

$_['text_rate_sub_total']    = 'Подитог';
$_['text_unit_range']    = 'Диапазон';
$_['text_delete_all']    = 'Удалить все';
$_['text_csv_import']    = 'CSV Импорт';
$_['text_start']    = 'От';
$_['text_end']    = 'До';
$_['text_cost']    = 'Стоимость';
$_['text_qnty_block']    = 'Диапазон';
$_['text_add_new']    = 'Добавить';
$_['text_final_cost']    = 'Окончательная стоимость';
$_['text_final_single']    = 'Одна';
$_['text_final_cumulative']    = 'Сумма';
$_['text_percentage_related']    = 'Процент от';
$_['text_percent_sub_total']    = 'Сумма';
$_['text_percent_total']    = 'Итого';
$_['text_percent_shipping']    = 'Стоимость доставки';
$_['text_percent_sub_total_shipping']    = 'Сумма с доставкой';
$_['text_percent_total_shipping']    = 'Итого с доставкой';
$_['text_price_adjustment']    = 'Корректировка стоимости';
$_['text_price_min']    = 'Мин.';
$_['text_price_max']    = 'Макс.';
$_['text_price_add']    = 'Операция';
$_['text_days_week']    = 'Дни недели';
$_['text_time_period']    = 'Диапазон времени';
$_['text_sunday']    = 'Воскресенье';
$_['text_monday']    = 'Понедельник';
$_['text_tuesday']    = 'Вторник';
$_['text_wednesday']    = 'Среда';
$_['text_thursday']    = 'Четверг';
$_['text_friday']    = 'Пятница';
$_['text_saturday']    = 'Суббота';
$_['text_logo']    = 'Ссылка на лого';

$_['entry_all']    = 'Все';
$_['entry_any']    = 'Любые';
$_['text_mask_price']    = 'Текст вместо стоимости 0';

// Entry 
$_['entry_weight_include']       = 'Включить вес в название:';
$_['entry_cost']       = 'Стоимость доставки:';
$_['entry_name']       = 'Название способа доставки';
$_['text_name_tip'] = 'Название способа доставки, которое будет видеть клиент';
$_['entry_desc']       = 'Описание';
$_['entry_order_total']       = 'Диапазон суммы заказа:';
$_['entry_order_weight']       = 'Диапазон веса заказа:';
$_['entry_quantity']       = 'Диапазон количества товаров:';
$_['entry_to']       = 'до';
$_['entry_order_hints']       = 'Укажите 0 чтобы не применять';
$_['entry_tax']        = 'Налог:';
$_['entry_geo_zone']   = 'Геозона:';
$_['entry_status']     = 'Статус:';
$_['entry_sort_order'] = 'Порядок:';
$_['entry_customer_group'] = 'Группа покупателей:';
$_['entry_store'] = 'Магазин:';
$_['entry_manufacturer'] = 'Производитель:';
$_['store_default'] = 'По умолчанию';
$_['text_all'] = 'Любые';
$_['text_category'] = 'Условия по категории';
$_['text_multi_category'] = 'Для нескольких категорий';
$_['text_category_any'] = 'Для любых категорий';
$_['text_category_all'] = 'В корзине должны быть все следующие категории';
$_['text_category_least'] = 'Любая из выбранных категорий';
$_['text_category_least_with_other'] = 'Любая из выбранных категорий с другими категориями';
$_['text_category_except'] = 'Кроме выбранных категорий';
$_['text_category_exact'] = 'Только для выбранных категорий';
$_['text_category_except_other'] = 'За исключением выбранных категорий с другими категориями';

$_['entry_category']     = 'Категории';
$_['text_product'] = 'Условия по товарам';
$_['text_product_any'] = 'Для любых товаров';
$_['text_product_all'] = 'В корзине должны быть все следующие товары';
$_['text_product_least'] = 'Любой из выбранных товаров';
$_['text_product_least_with_other'] = 'Любой из выбранных товаров с другими';
$_['text_product_exact'] = 'Только для выбранных товаров';
$_['text_product_except'] = 'За исключением выбранных товаров';
$_['text_product_except_other'] = 'За исключением выбранных товаров с другими';
$_['entry_product']     = 'Товары';
$_['text_geo_address']     = 'Получение геозоны из';

$_['text_manufacturer_rule'] = 'Условия по производителям';
$_['text_manufacturer_any'] = 'Для любых производителей';
$_['text_manufacturer_all'] = 'В корзине должны быть все следующие производители';
$_['text_manufacturer_least'] = 'Любой из выбранных производителей';
$_['text_manufacturer_least_with_other'] = 'Любой из выбранных производителей с другими';
$_['text_manufacturer_exact'] = 'Только для выбранных производителей';
$_['text_manufacturer_except'] = 'За исключением выбранных производителей';
$_['text_manufacturer_except_other'] = 'За исключением выбранных производителей с другими';

$_['text_dimensional_weight'] = 'Объемный (размерный) вес';
$_['text_dimensional_weight_method'] = 'Объемный вес - только метод';
$_['text_dimensional_factor'] = 'Объемный весовой коэффициент';
$_['text_dimensional_overrule'] = 'Учитывайть фактический вес, если он больше, чем объемный вес';

$_['button_save_continue'] = 'Сохранить и продолжить';
$_['ignore_modifier'] = 'Игнорировать корректировку цены, если <i>Стоимость на диапазон</i> не стало активным';

$_['entry_group_name']       = 'Название группы';
$_['text_admin_name'] = 'Название для админа';
$_['text_admin_name_tip'] = 'Показывается при просмотре заказа администратором. Может совпадать с названием способа.';
$_['text_hide'] = 'Скрыть другие способы:';
$_['text_hide_tip'] = 'Скрыть другие "мои способы", если этот способ активирован';
$_['text_hide_placeholder'] = 'Введите названия способов';

/* tooltip */
$_['tip_group_name']       = 'Имя метода будет заменено указанным именем группы. Можно вставить оригинальное имя метода и цену в название группы. Для ввода имени правилом является номер метода, которому предшествует #. Например, #1 означает первое имя метода. Аналогично для цены используйте @. Например, @1 означает цену первого метода.';
$_['tip_group_limit']       = 'Вы можете ограничить количество самых высоких / самых низких методов для отображения. По умолчанию будет показан только один метод';
$_['tip_weight_include']       = 'Будет отображать вес корзины рядом с названием метода доставки';
$_['tip_sorting_own']       = 'Порядок сортировки';
$_['tip_status_own']       = 'Включить / отключить только этот конкретный метод';
$_['tip_store']       = 'Зависимость доступности способа доставки от магазина';
$_['tip_geo']       = 'Зависимость доступности способа доставки от геозоны клиента';
$_['tip_manufacturer']       = 'Зависимость доступности способа доставки от производителей товаров в корзине';
$_['tip_customer_group']       = 'Зависимость доступности способа доставки от группы клиента';
$_['tip_zip']       = 'Зависимость доступности способа доставки от почтового индекса';
$_['tip_coupon']       = 'Зависимость доступности способа доставки от введенного клиентом купона';
$_['tip_category']       = 'Зависимость доступности способа доставки от категорий товаров, которые добавлены в корзину';
$_['tip_multi_category']       = 'Эта опция будет применяться только если у товара больше чем одна категория';
$_['tip_product']       = 'Зависимость доступности способа доставки от товаров в корзине';
$_['tip_manufacturer_rule']       = 'Выберите одно из условий по производителям товаров в корзине';
$_['tip_rate_type']       = 'Выберите тип формирования стоимости доставки';
$_['tip_cost']       = 'Разрешено фикс.значение или проценты например 5% или 300.';
$_['tip_unit_start']       = 'Отсчет начнется с этого значения';
$_['tip_unit_end']       = 'Отсчет закончится в этом значении';
$_['tip_unit_price']       = 'Если \'<i>Стоимость на диапазон</ i>\' равно 0, тогда цена будет для выбранного диапазона этой строки. <br /> Если \'<i>Стоимость на диапазон</ i>\' больше 0, тогда цена будет равна \'Стоимость на диапазон\'. Можно задавать в процентах, например 5, 7% и т.д.';
$_['tip_unit_ppu']       = '<b>Стомость на дипазон</ b>. Если вы хотите рассчитать стоимость доставки на основе единицы блока, вы можете использовать эту функцию. Например, если вы хотите взимать $ 5 за каждые 3 элемента, общее количество будет равно 10. Так что вам нужно будет установить: От = 0, До = 10, Стоимость = 5 и Дипазон = 3. Просто <i>Стомость на дипазон</ i> означает цену за каждую n-ю единицу';
$_['tip_single_commulative']       = '<b>Одна</b>. Между соответствующими диапазонами будет рассматриваться только соответствующая строка. <br/> <b>Сумма</b>. Рассматривается несколько строк. Таким образом, стоимость будет накапливаться от начального ряда до соответствующего ряда.';
$_['tip_percentage']       = 'Пожалуйста, выберите, от чего будет рассчитываться стоимость доставки если "Стоимость" выше задана в процентах.';
$_['tip_price_adjust']       = 'Вы можете настроить окончательную цену. <br/> <b> Мин. </b>: если итоговая цена меньше, чем Мин, будет учитываться Мин. <br/> <b> Макс </b>. Если окончательная цена превышает Макс, будет учитываться Макс. <br/> <b> Модификатор </b>. Любое значение с оператором (+, -, *, /), которое будет добавлено / умножено / вычтено / разделено в окончательной цене, зависит от оператора. например: +5.2 означает, что 5.2 будет добавлено в окончательную цену';
$_['tip_day']       = 'Пожалуйста, выберите дни, для которых этот способ доставки будет действителен';
$_['tip_time']       = 'Пожалуйста, установите период времени для этого способа доставки.';
$_['tip_heading']       = 'Заголовок группы доставки на сайте';
$_['tip_status_global']       = 'Включить или отключить модуль';
$_['tip_sorting_global']       = 'Порядок сортировки в способах доставки';
$_['tip_grouping']       = 'Правила те же, что и для группы способов, но эта группировка будет работать с группой групп. Способы доставки, имеющие одинаковое значение <i>Порядок сортировки</i>, будут рассматриваться как группа.';
$_['tip_debug']       = 'Только для тестирования. Это покажет причину, по которой определенный способ доставки не появляется при оформлении заказа';
$_['tip_desc']       = 'Необязательное поле. Для отображения небольшого описания под названием способа доставки на сайте, если это разрешает модуль оформления заказа';
$_['tip_import']       = 'CSV будет выглядеть как <br /><br /> 1,10,4.99,0,0 <br />11,20,5.99,2,0<br />21,30,6.99,0,0';
$_['tip_text_logo'] = 'Необязательное поле. Разрешен только URL изображения. Этот логотип будет отображаться перед названием способа, если это разрешает ваш модуль оформления заказа';

$_['tip_postal_code']='Разделитель - запятая. Поддержка подстановочных знаков (*,?) и диапазона индексов. <br /><b>Пример:</b><br />12345,443300-443399,9843*,875*22,45433?,S3432?2 <br />';

$_['text_partial']    = 'Не полный диапазон';
$_['tip_partial'] ='Будет рассмотрено патиальное суммирование цен. Например, если из 5 блоков пользователь выбирает только 3, будет начисляться стоимость за 3 блока';
$_['text_yes']    = 'Да';
$_['text_no']    = 'Нет';
$_['text_additional']    = 'Стоимость за диапазон';
$_['tip_additional'] ='Эта опция автоматически рассчитывает стоимость доставки на основе последней найденной цены, если не найдено совпадений из вышеуказанных диапазонов единиц, т.е. цена = (Последняя найденная цена + (дополнительная цена * дополнительные единицы)).';

$_['text_sort_type']    = 'Сортировка';
$_['text_sort_manual']    = 'Ручная';
$_['text_sort_price_asc']    = 'По увеличению стоимости';
$_['text_sort_price_desc']    = 'По уменьшнию стоимости';
$_['tip_text_sort_type'] ='';

$_['tip_weight']       = 'Дипазон веса заказа. Будет производится проверка вместе с другими правилами.';
$_['tip_total']       = 'Диапазон сумм заказа. Будет производится проверка вместе с другими правилами.';
$_['tip_quantity']       = 'Диапазон количества товаров. Будет производится проверка вместе с другими правилами.';

$_['text_export']    = 'Экспорт';
$_['tip_export'] = 'Экспорт настроек модуля';
$_['text_import']    = 'Импорт';
$_['tip_import'] = 'Внимание! Это перезапишет все текущие настройки.';
$_['tab_import_export']    = 'Импорт/Экспорт';

$_['text_country']    = 'Страна';
$_['text_city']    = 'Город';
$_['text_city_enter']    = 'Введите список городов';
$_['tip_city']    = 'Пожалуйста, выберите подходящие города';
$_['text_city_enter_tip']    = 'Каждый город с новой строки';
$_['text_city_rule']    = 'Условия по Городу';
$_['text_city_rule_inclusive']    = 'Только для введенных городов';
$_['text_city_rule_exclusive']    = 'Для всех, кроме введенных городов';
$_['text_coupon_tip']    = 'Список кодов купонов разделенных запятой (,)';
$_['text_country_tip']    = 'Пожалуйста, выберите подходящие страны';

$_['text_equation']    = 'Окончательная формула';
$_['tip_equation']    = 'Любая арифметическая формула. Если предусмотрено, окончательная стоимость доставки будет рассчитываться на основе этой формулы.';
$_['text_equation_help'] = 'Доступные параметры {cartTotal}, {cartQnty}, {cartWeight} {shipping}, {modifier}. Например: {cartTotal}-5*{cartQnty}';

$_['text_option'] = 'Условия по опциям товаров';
$_['text_option_any'] = 'Для любых опций товара';
$_['text_option_all'] = 'В корзине должны быть все следующие опции';
$_['text_option_least'] = 'Любая из выбранных опций есть в корзине';
$_['text_option_least_with_other'] = 'Любая из выбранных опций с другими опциями';
$_['text_option_exact'] = 'Только для выбранных опций';
$_['text_option_except'] = 'Кроме выбранных опций';
$_['text_option_except_other'] = 'За исключением выбранных опций с другими';
$_['entry_option']     = 'Опции товаров';
$_['tip_option']       = '<b>Для любых опций товара</b>: действительно для любых опций. <br/> <b>В корзине должны быть все следующие опции< b>: выбранные параметры должны быть в корзине покупок. с другими опциями. <br/> <b>Любая из выбранных опций с другими</b>. По крайней мере, один из выбранных товаров должен быть в корзине с другими опциями. <br/> <b>Любая из выбранных опций есть в корзине</b>. В корзине должен быть хотя бы один из выбранных товаров. Другие параметры недопустимы. <br/> <b>Только для выбранных опций</b>. Все параметры корзины должны быть в выбранных параметрах. Другие варианты не допускаются. <br/> <b>Кроме выбранных опций</b>: в корзине не должно быть ни одного из выбранных параметров. Разрешены только невыбранные варианты.<br/> <b>Кроме выбранных опций с другими </b>: в корзине могут быть выбранные опции, только если в корзине есть хотя бы какая-либо другая опция';
$_['entry_payment']  = 'Способы оплаты:';
$_['tip_payment']       = 'Укажите способы оплаты для которых этот способ доставки будет доступен.';

// Error
$_['error_permission'] = 'Предупреждение: у вас нет прав на изменение настроек модуля!';
$_['error_filetype'] = 'Неверный тип файла. Допускается только CSV';
$_['error_upload'] = 'Ошибка! Невозможно загрузить';
$_['error_no_data'] = 'Не найдено данных для импорта';
$_['error_partial'] = 'Частичная ошибка загрузки. Пожалуйста, проверьте ограничение размера загрузки на сервере.';
$_['error_import'] = 'Пожалуйста, выберите правильный файл для импорта';
																																																																																												$_['heading_title']    = '<a href="https://opencart3x.ru" target="_blank" title="Разработчик Opencart3x.ru" style="color:#233746"><i class="fa fa-circle-o"></i></a> '. $_['page_title'];